"""



creating iterable objects


iterable objects:
به آبجکت هایی گفته میشود که بتوان داخل آنها با استفاده از حلقه فور پیمایش  و به تک تک آیتم های آن دسترسی داشت
برای ساخت چنین آبجکت هایی از دو متد روبرو استفاده میکنیم: __iter__, __next__

iter method(ایتریبل: قابل تکرار):
در اولین دور حلقه فور، این متود فعال می شود و آبجکت ما را تبدیل به یک ایتریبل می کند
در متود ایتر ما خیلی ساده سلف رو ریترن می کنیم و خود پایتون برای ما آبجکت رو قابل پیمایش می کند

next method:
نحوه دسترسی به آیتم های آبجکت رو مشخص میکنه
مرحله به مرحله که حلقه فور اجرا می شود، مقدار بعدی را بر می گرداند


نحوه ایجاد آبجکت ایتریبل:
باید کلاسی ایجاد کنیم که دو متود بالا در آن وجود داشه باشد. آبجکتمون رو با استفاده از ایتر، قابل پیمایش
کنیم و در نکست اتفاقی که قرار است برای حلقه فور بیفتد را تعیین کنیم



"""


class A:
    def __init__(self, value):
        self.value = value
        self.current = 0

    def __iter__(self):
        return self
    
    def __next__(self):
        if self.current < self.value:
            current = self.current
            self.current += 1
            return current
        raise StopIteration



a1 = A(10)
for i in a1:
    print(i)