"""


sys module => System-Specific Parameters and Function:
    path, maxsize, executable, platform, version, exit(), argv

این ماژول درباره پارامتر ها و فانکشن های مربوط به سیستم عامل است. درواقع این ماژول متغییر ها و مودهایی
دارد که مفسر پایتون درباره ان صحبت می کند


path:
آدرس هایی است که مفسر پایتون در آنان جستجو می کنه و به دنبال پکیج ها می گردد
هنگام استفاده پایتون در حالت اسکریپت نویسی، اولین آدرس، آدرس جایی است که اسکریپت در آن وجود دارد
هنگام استفاده پایتون در حالت تعاملی، اولین آدرس همیشه یک استرینگ خالی است
جواب برگشتی "پس" یک لیست است، در نتیجه می توان مقداری را به آن اضافه نمود


maxsize:
بزرگ ترین اینتیجری است که سیستم می تواند در یک متغییر نگه داری کند
بسته به نوع سیستم (۶۴ یا ۳۲ بیتی)، مقدار آن فرق دارد. فرمولی که دارد استفاده می کند:
سیستم ۶۴ بیت: ۲**63-۲ است. سیستم ۳۲ بیتی: 1**۳۱-۲ است


executable:
نسخه ای از پایتون که در حال حاضر بر روی اسکریپت ما فعال است


platform:
نوع سیستم عامل ما را می آورد


version:
نوع ورژن پایتون که در حال حاضر استفاده می کنیم. در گذشته استفاده زیادی داشت وقتی از پایتون سه و دو استفاده
می کردند. در موقع ایمپورت کردن، شروطی را می گذاشتند


exit():
ما را از حالت ران برنامه خارج می کند


argv:
به ما اجازه می دهد زمانی که داریم برنامه رو اجرا می کنیم، یکسری آرگومان ها را از طریق ترمینال دریافت کنیم
آرگوی، یک لیست است که همیشه ایندکس صفر آن آدرس اسکریپت است


"""
import sys


# --- path
# sys.path.append('/')
# print(sys.path)


# --- maxsize
# print(sys.maxsize)


# --- executable
# print(sys.executable)


# --- platform
# print(sys.platform)


# --- version
# print(sys.version)


# --- exit()
# if sys.platform == 'linux':
#     sys.exit()
# else:
#     print('non-linux')


# --- argv
# print((sys.argv))
# if sys.argv[1] == 'admin':
#     print('Hello Boss')
# else:
#     sys.exit()
