"""


what is that?
if __name__ == '__main__'

این برای تشخیص روش اجرا شدن ماژول بطور مستقیم است یا یک جای دیگه ایمپورت شده و انجا ران شده؟

زمانی که ما یک ماژول پایتونی می نویسیم، قبل از ران شدن، خود پایتون میاد و یکسری "اسپیشال وریبل" ست می کنه و 
داخل هر کدام یکسری مقادیر را ست می کند. یکی از آن "اسپیشال وریبل ها"، "داندر نیم" است

داندر نیم:
بصورت پیشفرض دو مقدار می گیرد
اگر بصورت مستقیم ماژول رو ران کنیم همیشه مقدار "داندر مین" را می گیرد
اگر این ماژول رو بصورت مستقیم ران کنیم، مقدار "داندر نیم" برابر اسم ماژول می شود
یکی از کاربرد های این اسپیشال متود، اجرای یک فانکشن به هنگام ران شدن ماژول می باشد. زمانی که ماژول ران
شد، این فانکشن رو کال کن، اما اگر جایی ایمپورت شد، این کارو نکن


"""

# print(f'__name__ => {__name__}') # __main__

def show():
    print('module __name__')

if __name__ == '__main__':
    show()