"""



polymorphism:
    Greek => poly(many), morphism(forms(shapes))

در شی گرایی چندریختی به این معنی هست که کدهای ما بتوانند در شرایط مختلف به شکل های مختلفی پاسخ دهند
پلی مورفیسم توانایی استفاده از یک رابط یکسان برای اشکال مختلف مانند انواع داده ها یا کلاس ها است
چندریختی به توابع اجازه می دهد تا در زمانهای مختلف از موجودیت های مختلف استفاده کنند
برای برنامه نویسی شی گرا در پایتون، این بدان معناست که یک شی خاص متعلق به یک کلاس خاص می تواند
به همان شیوه ای استفاده شود که گویی شیء متفاوتی متعلق به یک کلاس متفاوت است
پلی مورفیسم امکان انعطاف پذیری و اتصال شل را فراهم می کند تا بتوان کد را به مرور گسترش و به راحتی حفظ کرد

یک زمان هایی متودی که در سوپرکلاس هست کار مطلوبی رو برای ما انجام نمیده
پلیمرفیس به ما اجازه میده که بیایم همون متود رو ایجاد کنیم درحالی که نتیجه متفاوتی رو برای ما ایجاد می کنه

مثال:
در دیزاین پترن فکتوری قسمت کریتور داره از پلی مرفیس استفاده می کنه



"""

from abc import ABC, abstractmethod


class Animal(ABC):
    def __init__(self, name):
        self.name = name

    @abstractmethod
    def talk(self):
        pass


class Cat(Animal):
    def talk(self):
        print('mewoo...')

class Dog(Animal):
    def talk(self):
        print('Haap...')

c1 = Cat('mik')
d1 = Dog('poi')

c1.talk()
d1.talk()