"""



__new__


در پایتون متد 'نیو' مسئول ساخت یک کلاس جدید هست
متود 'نیو' تنها متودی است که قبل از متود 'اینیت' فعال می شود و اجازه میده داندر اینیت فعال بشه
کمتر پیش میاد که ما در پروژه های کوچیک و متوسط اینو ببینیم، بیشتر در پروژه های بزرگ هستند مثل
جنگو و استفاده کردنشون هم به یک نحوه خاص هست

وظیفه:
مسئول نحوه ایجاد شدن یک کلاس هست
خیلی جاها گفتن داندر اینیت مسئول ساخت یک کلاس هست ولی این اشتباهه! کانسترکتور یک کلاس داندر نیو است
داندر اینیت فقط اینیشیالایز است!‌ یعنی مقدمه ساز

نحوه کار کردن:
زمانی که داریم نمونه سازی می کنیم، متود داندر نیو فعال می شود. بعد خود کلاس به شکل یک آبجکت
به داندر نیو ارسال می شود. در آنجا عملیات های مورد نیاز صورت می گیرد و کلاس ساخته می شود

اینکه چطور یک کلاس قبل از ساخته شدن به داندر نیو ارسال میشه اونم به صورت یک آبجکت، مربوط به متاکلاس ها است



"""



class Person:

    def __new__(cls, name, *args, **kwargs):
        if name == 'Rose':
            return None
        else:
            return super().__new__(cls, *args, **kwargs)

    def __init__(self, name):
        self.name = name



person_1 = Person('Mahdi')
print(person_1)


# Meta Class
print(person_1.__class__.__class__) # output => <class 'type'>