"""



class variable evaluation:
    python class variables evaluate on declaration/import

کلاس وریبل ها پایتون در زمان ایجاد شدن یا ایمپورت شدن ارزیابی خواهند شد
به این معنی که اگر شما کلاسی را فقط ایجاد کنید و از آن هیچ استفاده نکنید کلاس وریبل های آن اجرا خواهند شد و
اگر شما در کلاس وریبل هایتان کار سنگینی انجام داده باشید در سرعت تاثیر منفی خواهد گذاشت

فقط و فقط کلاس وریبل ها اجرا خواهند شد
اینستنس وریبل ها اجرا نمی شوند. فقط  و فقط کلاس وریبل ها اجرا می شوند

در جنگو بشدت خطرناکه این مورد


"""

class A:
    work = [i+2 for i in range(1, 30000000)]

    def __init__(self):
        print('work is made!')


class B:
    one = A().work