"""


__all__
در پایتون برای مدیریت کردن "ایمپورت" از "داندرآل" استفاده میشود
لیستی از مواردی است که ما می خواهیم خارج از ماژول در دسترس باشه
از این عبارت بیشتر در پروژه های بزرگ استفاده میشود
این عبارت با ترکیب فایل "اینیت" در پایتون میتواند برای ساده سازی "ایمپورت" استفاده شود

یادآوری:
زمانی که ما می خواهیم همه موارد رو ایمپورت کنیم، می توانیم از * استفاده کنیم ولی
با این روش اون هایی که اسمشون با آندرلاین شروع می شود، ایمپورت نخواهند شد
اگر بخواهیم چیز هایی که با آدرلاین شروع شده اند، ایمپورت کنیم باید بصورت صریح اون رو بنویسیم


داندرآل:
زمانی که ما داریم برنامه نویسی می کنیم، یکسری از کدها هستند که برای مصرف شخصی خود ماژول است
برای مثال در ماژول داخلی کالکشنز، بعد از داندرآل یکسری کد هستند که برای خود ماٰژول نوشته شده است(با آندرلاین شروع شده)
الان اگر با ستاره همه چیز رو ایمپورت کنیم، اون کدها در دسترس نیستند
داندرآل زمانی فعال می شود که ما با * ایمپورت کنیم
زمانی که با * همه چیز رو ایمپورت می کنیم، ستاره میاد چیز هایی رو ایمپورت می کنه که در داندرآل نوشته شده
بقیه موارد هم براش مهم نیست چطوری شروع شده باشه، فقط همون چیزهایی رو میاره که در داندرآل است
برای ایمپورت کردن بقیه موارد باید بصورت صریح نوشته شود

کار در پروژه های بزرگ:
در جنگو ما داریم خیلی راحت اسم ماژول رو اسکپت می کنیم و مستقیم کد رو کلاس می زنیم
چطوری این اتفاق می افتد:
در اولین مرحله، داندرآل را در تمامی ماژول ها می نویسیم، تمامی کلاس هایی که می خوایم با * در دسترس باشد
در مرحله بعد، در سند اینیت.پای، تمامی ماژول ها رو ایمپورت می کنند با استفاده از ستاره
بعد به محض اینکه ما ماژول رو ایمپورت می کنیم، اینیت.پای فعال می شود و اینیت.پای هم که کار خودشو انجام میده


"""

# ------------- collections

# from collections import *

# __all__ = [
#     'ChainMap',
#     'Counter',
#     'OrderedDict',
#     'UserDict',
#     'UserList',
#     'UserString',
#     'defaultdict',
#     'deque',
#     'namedtuple',
# ]

# -------------



# ------------- django

# from django import forms

# # explicit
# forms.fields.Field()
# forms.fields.CharField()
# forms.widgets.Media()

# # ignoere module name
# forms.Field()
# forms.CharField()
# forms.Media()

# -------------