"""


OOP:
     برنامه نویسی شی گرا یک شیوه برنامه نویسی است که با استفاده از آن میتوانید کدهای خود را در کلاس‌ها دسته بندی کنید
     و سپس از این کلاس‌‌ها نمونه های کوچک تر ساخته و به اطلاعات کلاس دسترسی پیدا کنید
     با برنامه نویسی شی گرا میتوانید از از دنیای واقعی تقلید کنید
     میتوانید کلاسی برای اتومبیل داشته باشید که موارد مانند سرعت، قیمت یا شرکت سازنده را مشخص میکند
     برنامه نویسی شی گرا به اختصار oop نیز نامیده میشود که مخفف کلمه Object-Oriented Programming است
     برنامه نویسی شی گرا اولین بار در سال 1960 معرفی شد و در حال حاضر اکثر زبان‌ها برنامه نویسی از آن پشتیبانی میکنند



class:
    کلاسها مانند یک طرح اولیه هستند که می توانید برای ایجاد اشیاء از آنها استفاده کنید
    کلاس‌ها رفتارهای کلی را مشخص میکنند که بعدا ممکن است توسط آبجکت‌‌ها تغییر داده شوند
    کلاس‌ها معمولا اطلاعاتی داخل خود ذخیره نمیکنند و فقط مشخص میکنند که یک چیز باید چه شکلی باشد

    برای ساخت یک آبجکت از کلاس کافیست کلاس مورد نظر را در یک متغیر ذخیره کنید
    به ساخت آبجکت از یک کلاس instantiating میگویند
    نام آبجکت هر چیزی میتواند باشد اما سعی کنید نامی معنی دار انتخاب کنید
    آبجکت‌ها میتوانند به تمام اطلاعاتی که در کلاس وجود دارند دسترسی کامل داشته باشند
    هر آبجکت ویژگی هایی دارد که می تواند بصورت پیشفرض داشته باشد یا خودش تعریف کند
    ویژگی ها دلبخواه هستند و محدودیتی نیز ندارند
    نمونه ها می توانند در جزئیات تفاوت داشته باشند ولی در کلیت یکی هستند
    جای هر آبجکت و پراپرتی و متود هاش همیشه محفوظ است(در مموری) و
    هیچ آبجکتی به پراپرتی و متودهای آبجکت دیگری دسترسی ندارند



"""

class Car: # blueprint (حالت کلی)
    pass


car_1 = Car() # instance or object
car_1.name = 'Benz' # attribute or property
car_1.price = 40000 # attribute or property


# car.property => this . name is 'dot notation'. we access to property or create new property with that.
print(car_1.name, car_1.price)


car_1.price = 45000 # change property
